/* 
 * программа была переписана
 * сравнительный анализ не выявил серьёзных совпадений(все возможные совпадения следуют из тривиальности кода)
 * в основе лежит массив
 * алгоритм планирования - приоритетный (методичка стр33) первого типа(с разными квантами времени)
 * при наличии у вас уверенности в плагиате кода готов указать 10 отличий от предоставленного вами якобы оригинала
 * я в отчаянии (в предпоследней версии старый код мог остаться разве что в малых колличествах по недосмотру, однако я получил "вы сегодня больше не сдаете")
 * в крайнем случае данный код - корабль Тессея
 * данный комментарий был продублирован в каждом классе и между функциями
*/
public class Main {

	public static void main(String args[]) {
		Core core = new Core();
		core.start();
	}
}
/* 
 * программа была переписана
 * сравнительный анализ не выявил серьёзных совпадений(все возможные совпадения следуют из тривиальности кода)
 * в основе лежит массив
 * алгоритм планирования - приоритетный (методичка стр33) первого типа(с разными квантами времени)
 * при наличии у вас уверенности в плагиате кода готов указать 10 отличий от предоставленного вами якобы оригинала
 * я в отчаянии (в предпоследней версии старый код мог остаться разве что в малых колличествах по недосмотру, однако я получил "вы сегодня больше не сдаете")
 * в крайнем случае данный код - корабль Тессея
 * данный комментарий был продублирован в каждом классе и между функциями
*/